eis-cart-tests-master@3bc714a7387/tests/test-data/DevTest/TOM-3437/testdata/esi_newcash_reds_MY.xml

<?xml version="1.0" encoding="UTF-8"?>
<NEWCASH ASOF_DATE="7/12/2018" CREATE_DATE="7/12/2018" RECORDS="7">
    <NEWCASH_ITEM>
        <AMOUNT>-1000000.0000000000</AMOUNT>
        <AUTHORIZED_BY>p9msingh</AUTHORIZED_BY>
        <CASH_TYPE>CASHOUT</CASH_TYPE>
        <CONFIRMED_BY>AUTO</CONFIRMED_BY>
        <CONFIRMED_DATE>6/21/2018</CONFIRMED_DATE>
        <CONTACT></CONTACT>
        <CURRENCY>USD</CURRENCY>
        <ENTRY_DATE>6/21/2018</ENTRY_DATE>
        <ESTIMATED>F</ESTIMATED>
        <EXTERN_NEWCASH_set SIZE="0"></EXTERN_NEWCASH_set>
        <FUND>3315</FUND>
        <MODIFIED_BY>p9msingh</MODIFIED_BY>
        <MODIFY_DATE>6/21/2018</MODIFY_DATE>
        <MODIFY_TIME>6/21/2018 3:24:18.320</MODIFY_TIME>
        <NEWCASH_ID>59235.0000000000</NEWCASH_ID>
        <NOTATION>Test CFE transaction</NOTATION>
        <PORTFOLIOS_PORTFOLIO_NAME>AYPDEF</PORTFOLIOS_PORTFOLIO_NAME>
        <REASON>REDS</REASON>
        <SETTLE_DATE>6/26/2018</SETTLE_DATE>
        <SOURCE>X</SOURCE>
        <SOURCE_DESC>Transition Source</SOURCE_DESC>
        <STATUS>CONFIRMED</STATUS>
        <SYSTEM_OWNER>CapitalFlowsEnt</SYSTEM_OWNER>
        <TOUCH_COUNT>2</TOUCH_COUNT>
        <TRADE_DATE>6/21/2018</TRADE_DATE>
        <TYPE>CASH</TYPE>
    </NEWCASH_ITEM>
</NEWCASH>
