eis-cart-tests-master@3bc714a7387/tests/test-data/DevTest/TOM-3437/testdata/esi_newcash_subs_Non-VN_Non-MY.xml

<?xml version="1.0" encoding="UTF-8"?>
<NEWCASH ASOF_DATE="7/12/2018" CREATE_DATE="7/12/2018" RECORDS="7">
    <NEWCASH_ITEM>
        <AMOUNT>941000.0000000000</AMOUNT>
        <AUTHORIZED_BY>p9achoo</AUTHORIZED_BY>
        <CASH_TYPE>CASHIN</CASH_TYPE>
        <CONFIRMED_BY>AUTO</CONFIRMED_BY>
        <CONFIRMED_DATE>7/12/2018</CONFIRMED_DATE>
        <CONTACT></CONTACT>
        <CURRENCY>CNY</CURRENCY>
        <ENTRY_DATE>7/12/2018</ENTRY_DATE>
        <ESTIMATED>F</ESTIMATED>
        <EXTERN_NEWCASH_set SIZE="0"></EXTERN_NEWCASH_set>
        <FUND>3173</FUND>
        <MODIFIED_BY>p9achoo</MODIFIED_BY>
        <MODIFY_DATE>7/12/2018</MODIFY_DATE>
        <MODIFY_TIME>7/12/2018 4:42:03.663</MODIFY_TIME>
        <NEWCASH_ID>68599.0000000000</NEWCASH_ID>
        <NOTATION>CNH cash transfer to CNY settlement 13Jul as per PA request</NOTATION>
        <PORTFOLIOS_PORTFOLIO_NAME>ALAHYB</PORTFOLIOS_PORTFOLIO_NAME>
        <REASON>SUBS</REASON>
        <SETTLE_DATE>7/14/2018</SETTLE_DATE>
        <SOURCE>X</SOURCE>
        <SOURCE_DESC>Transition Source</SOURCE_DESC>
        <STATUS>CONFIRMED</STATUS>
        <SYSTEM_OWNER>CapitalFlowsEnt</SYSTEM_OWNER>
        <TOUCH_COUNT>2</TOUCH_COUNT>
        <TRADE_DATE>7/12/2018</TRADE_DATE>
        <TYPE>CASH</TYPE>
    </NEWCASH_ITEM>
</NEWCASH>
