eis-cart-tests-master@3bc714a7387/tests/test-data/DevTest/TOM-3437/testdata/esi_newcash_subs_VN.xml

<?xml version="1.0" encoding="UTF-8"?>
<NEWCASH ASOF_DATE="7/12/2018" CREATE_DATE="7/12/2018" RECORDS="7">
    <NEWCASH_ITEM>
        <AMOUNT>1000000.0000000000</AMOUNT>
        <AUTHORIZED_BY>p9msingh</AUTHORIZED_BY>
        <CASH_TYPE>CASHIN</CASH_TYPE>
        <CONFIRMED_BY>AUTO</CONFIRMED_BY>
        <CONFIRMED_DATE>6/20/2018</CONFIRMED_DATE>
        <CONTACT></CONTACT>
        <CURRENCY>USD</CURRENCY>
        <ENTRY_DATE>6/20/2018</ENTRY_DATE>
        <ESTIMATED>F</ESTIMATED>
        <EXTERN_NEWCASH_set SIZE="0"></EXTERN_NEWCASH_set>
        <FUND>4009</FUND>
        <MODIFIED_BY>p9msingh</MODIFIED_BY>
        <MODIFY_DATE>6/20/2018</MODIFY_DATE>
        <MODIFY_TIME>6/20/2018 8:19:38.393</MODIFY_TIME>
        <NEWCASH_ID>58536.0000000000</NEWCASH_ID>
        <NOTATION>Test CFE trade</NOTATION>
        <PORTFOLIOS_PORTFOLIO_NAME>VVPVLA</PORTFOLIOS_PORTFOLIO_NAME>
        <REASON>SUBS</REASON>
        <SETTLE_DATE>6/25/2018</SETTLE_DATE>
        <SOURCE>X</SOURCE>
        <SOURCE_DESC>Transition Source</SOURCE_DESC>
        <STATUS>CONFIRMED</STATUS>
        <SYSTEM_OWNER>CapitalFlowsEnt</SYSTEM_OWNER>
        <TOUCH_COUNT>2</TOUCH_COUNT>
        <TRADE_DATE>6/20/2018</TRADE_DATE>
        <TYPE>CASH</TYPE>
    </NEWCASH_ITEM>
</NEWCASH>
